---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.GetOpenings
source: html/a338038d-e7d2-d89e-bad5-5249dbf63baa.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.GetOpenings Method

Gets a collection of all of the openings stored in this data.

## Syntax (C#)
```csharp
public IList<IFCExtrusionData> GetOpenings()
```

## Returns
The opening information.

## Remarks
Contains all of the openings stored via AddOpening().